betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_smbus.h
/** @brief  Clears the SMBUS STOPF pending flag.
  * @param  __HANDLE__ specifies the SMBUS Handle.
  *         This parameter can be SMBUS where x: 1, 2, or 3 to select the SMBUS peripheral.
  * @retval None
  */
#define __DAL_SMBUS_CLEAR_STOPFLAG(__HANDLE__)    \
  do{                                           \
    __IO uint32_t tmpreg = 0x00U;               \
    tmpreg = (__HANDLE__)->Instance->STS1;       \
    (__HANDLE__)->Instance->CTRL1 |= I2C_CTRL1_I2CEN;  \
    UNUSED(tmpreg);                             \
  } while(0)

/** @brief  Enable the SMBUS peripheral.
  * @param  __HANDLE__ specifies the SMBUS Handle.
  *         This parameter can be SMBUSx where x: 1 or 2  to select the SMBUS peripheral.
  * @retval None
  */
#define __DAL_SMBUS_ENABLE(__HANDLE__)           ((__HANDLE__)->Instance->CTRL1 |=  I2C_CTRL1_I2CEN)

/** @brief  Disable the SMBUS peripheral.
  * @param  __HANDLE__ specifies the SMBUS Handle.
  *         This parameter can be SMBUSx where x: 1 or 2  to select the SMBUS peripheral.
  * @retval None
  */
#define __DAL_SMBUS_DISABLE(__HANDLE__)          ((__HANDLE__)->Instance->CTRL1 &=  ~I2C_CTRL1_I2CEN)

/** @brief  Generate a Non-Acknowledge SMBUS peripheral in Slave mode.
  * @param  __HANDLE__ specifies the SMBUS Handle.
  * @retval None
  */
#define __DAL_SMBUS_GENERATE_NACK(__HANDLE__)    (CLEAR_BIT((__HANDLE__)->Instance->CTRL1, I2C_CTRL1_ACKEN))

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @addtogroup SMBUS_Exported_Functions
  * @{
  */

/** @addtogroup SMBUS_Exported_Functions_Group1 Initialization and de-initialization functions
 * @{
 */

/* Initialization/de-initialization functions  **********************************/
DAL_StatusTypeDef DAL_SMBUS_Init(SMBUS_HandleTypeDef *hsmbus);
DAL_StatusTypeDef DAL_SMBUS_DeInit(SMBUS_HandleTypeDef *hsmbus);
void DAL_SMBUS_MspInit(SMBUS_HandleTypeDef *hsmbus);
void DAL_SMBUS_MspDeInit(SMBUS_HandleTypeDef *hsmbus);

/* Callbacks Register/UnRegister functions  ************************************/
#if (USE_DAL_SMBUS_REGISTER_CALLBACKS == 1)
DAL_StatusTypeDef DAL_SMBUS_RegisterCallback(SMBUS_HandleTypeDef *hsmbus, DAL_SMBUS_CallbackIDTypeDef CallbackID, pSMBUS_CallbackTypeDef pCallback);
DAL_StatusTypeDef DAL_SMBUS_UnRegisterCallback(SMBUS_HandleTypeDef *hsmbus, DAL_SMBUS_CallbackIDTypeDef CallbackID);

DAL_StatusTypeDef DAL_SMBUS_RegisterAddrCallback(SMBUS_HandleTypeDef *hsmbus, pSMBUS_AddrCallbackTypeDef pCallback);
DAL_StatusTypeDef DAL_SMBUS_UnRegisterAddrCallback(SMBUS_HandleTypeDef *hsmbus);
#endif /* USE_DAL_SMBUS_REGISTER_CALLBACKS */

/**
  * @}
  */

/** @addtogroup SMBUS_Exported_Functions_Group2 Input and Output operation functions
  * @{
  */

/* IO operation functions  *****************************************************/
/** @addtogroup Blocking_mode_Polling Blocking mode Polling
 * @{
 */
/******* Blocking mode: Polling */
DAL_StatusTypeDef DAL_SMBUS_IsDeviceReady(SMBUS_HandleTypeDef *hsmbus, uint16_t DevAddress, uint32_t Trials, uint32_t Timeout);
/**
  * @}
  */

/** @addtogroup Non-Blocking_mode_Interrupt Non-Blocking mode Interrupt
 * @{
 */
/******* Non-Blocking mode: Interrupt */
DAL_StatusTypeDef DAL_SMBUS_Master_Transmit_IT(SMBUS_HandleTypeDef *hsmbus, uint16_t DevAddress, uint8_t *pData, uint16_t Size, uint32_t XferOptions);
DAL_StatusTypeDef DAL_SMBUS_Master_Receive_IT(SMBUS_HandleTypeDef *hsmbus, uint16_t DevAddress, uint8_t *pData, uint16_t Size, uint32_t XferOptions);
DAL_StatusTypeDef DAL_SMBUS_Master_Abort_IT(SMBUS_HandleTypeDef *hsmbus, uint16_t DevAddress);
DAL_StatusTypeDef DAL_SMBUS_Slave_Transmit_IT(SMBUS_HandleTypeDef *hsmbus, uint8_t *pData, uint16_t Size, uint32_t XferOptions);
DAL_StatusTypeDef DAL_SMBUS_Slave_Receive_IT(SMBUS_HandleTypeDef *hsmbus, uint8_t *pData, uint16_t Size, uint32_t XferOptions);

DAL_StatusTypeDef DAL_SMBUS_EnableAlert_IT(SMBUS_HandleTypeDef *hsmbus);
DAL_StatusTypeDef DAL_SMBUS_DisableAlert_IT(SMBUS_HandleTypeDef *hsmbus);
DAL_StatusTypeDef DAL_SMBUS_EnableListen_IT(SMBUS_HandleTypeDef *hsmbus);
DAL_StatusTypeDef DAL_SMBUS_DisableListen_IT(SMBUS_HandleTypeDef *hsmbus);

/****** Filter Configuration functions  */
#if  defined(I2C_FILTER_ANFDIS)&&defined(I2C_FILTER_DNFCFG)
DAL_StatusTypeDef DAL_SMBUS_ConfigAnalogFilter(SMBUS_HandleTypeDef *hsmbus, uint32_t AnalogFilter);
DAL_StatusTypeDef DAL_SMBUS_ConfigDigitalFilter(SMBUS_HandleTypeDef *hsmbus, uint32_t DigitalFilter);
#endif
/**
  * @}
  */

/** @addtogroup SMBUS_IRQ_Handler_and_Callbacks IRQ Handler and Callbacks
 * @{
 */
/******* SMBUS IRQHandler and Callbacks used in non blocking modes (Interrupt) */
void DAL_SMBUS_EV_IRQHandler(SMBUS_HandleTypeDef *hsmbus);
void DAL_SMBUS_ER_IRQHandler(SMBUS_HandleTypeDef *hsmbus);
void DAL_SMBUS_MasterTxCpltCallback(SMBUS_HandleTypeDef *hsmbus);
void DAL_SMBUS_MasterRxCpltCallback(SMBUS_HandleTypeDef *hsmbus);
void DAL_SMBUS_SlaveTxCpltCallback(SMBUS_HandleTypeDef *hsmbus);
void DAL_SMBUS_SlaveRxCpltCallback(SMBUS_HandleTypeDef *hsmbus);
void DAL_SMBUS_AddrCallback(SMBUS_HandleTypeDef *hsmbus, uint8_t TransferDirection, uint16_t AddrMatchCode);
void DAL_SMBUS_ListenCpltCallback(SMBUS_HandleTypeDef *hsmbus);
void DAL_SMBUS_ErrorCallback(SMBUS_HandleTypeDef *hsmbus);
void DAL_SMBUS_AbortCpltCallback(SMBUS_HandleTypeDef *hsmbus);

/**
  * @}
  */

/** @addtogroup SMBUS_Exported_Functions_Group3 Peripheral State, Mode and Error functions
  * @{
  */

/* Peripheral State, mode and Errors functions  **************************************************/
DAL_SMBUS_StateTypeDef DAL_SMBUS_GetState(SMBUS_HandleTypeDef *hsmbus);
DAL_SMBUS_ModeTypeDef DAL_SMBUS_GetMode(SMBUS_HandleTypeDef *hsmbus);
uint32_t DAL_SMBUS_GetError(SMBUS_HandleTypeDef *hsmbus);

/**
  * @}
  */

/**
  * @}
  */
/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/** @defgroup SMBUS_Private_Constants SMBUS Private Constants
  * @{
  */
#define SMBUS_FLAG_MASK  0x0000FFFFU
/**
  * @}
  */

